app/controllers/admin/resumes_controller.rb

  def index
    @job =Job.find(params[:job_id])
    @resumes = @job.resumes.order('created_at DESC')
---
SELECT "resumes".* FROM "resumes" WHERE "resumes"."job_id" = ? ORDER BY created_at DESC  [["job_id", 2]]