app/controllers/resumes_controller.rb

  def create
    @job = Job.find(params[:job_id])
    @resume = Resume.new(resume_params)
    @resume.job = @job
    @resume.user = current_user

    if @resume.save
---
INSERT INTO "resumes" ("job_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["job_id", 6], ["user_id", 1], ["content", "种庄稼能手，一亩能顶两亩。"], ["created_at", 2017-09-08 08:14:23 UTC], ["updated_at", 2017-09-08 08:14:23 UTC]]